app/controllers/quotes_controller.rb

  def index
    @qt = 1 + rand(Quote.count)
    @quotes = Quote.find( @qt)
---
SELECT count(*) AS count_all FROM `quotes`
SELECT * FROM `quotes` WHERE (`quotes`.`id` = 4)

  def show
    @quote = Quote.find(params[:id])
---
SELECT * FROM `quotes` WHERE (`quotes`.`id` = 1)

  def edit
    @quote = Quote.find(params[:id])
---
SELECT * FROM `quotes` WHERE (`quotes`.`id` = 1)

  def create
    @quote = Quote.new(params[:quote])

    respond_to do |format|
      if @quote.save
---
INSERT INTO `quotes` (`name`, `created_at`, `title`, `body`, `updated_at`, `email`) VALUES('vivek', '2010-12-30 10:02:20', 'Love quote', 'Love is blind', '2010-12-30 10:02:20', 'vvi@yaho.com')

  def update
    @quote = Quote.find(params[:id])

    respond_to do |format|
      if @quote.update_attributes(params[:quote])
---
SELECT * FROM `quotes` WHERE (`quotes`.`id` = 1)
UPDATE `quotes` SET `updated_at` = '2010-12-30 13:54:30', `check` = 1 WHERE `id` = 3

  def destroy
    @quote = Quote.find(params[:id])
    @quote.destroy
---
SELECT * FROM `quotes` WHERE (`quotes`.`id` = 4)
DELETE FROM `quotes` WHERE `id` = 4