app/controllers/users_controller.rb

SELECT * FROM `quotes`
---
  def index
    @quotes = Quote.all

INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', 'd85f41fb675766192610916b2e0a4205e973213f', '2010-12-30 11:23:12', 'd581218be9694413e674c0cb991973bc3067e305', NULL, '2010-12-30 11:23:12', NULL, 'admin', 'admin@admin.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save